content/about.md
+++
title = "About Me"
date = 2023-11-11T12:00:00+01:00
draft = false
author = "Konstantin Bücheler"
+++

Hello and welcome! My name is Konstantin, also known as d0ntrash on most platforms. I am a student, security researcher and hacker.
I focus on low-level topics such as Linux and Windows internals, embedded systems, and fuzzing.

This is my personal blog where I want to share a few of my mostly security-related projects.
I do this for fun and to force myself to write down what I learned so I don't forget it the week after.

Currently, I am doing my Master's degree in IT Security at TU Darmstadt while gathering some experience in vulnerability research.
My goal is to work as an independent freelancer after my graduation.
After finishing my bachelor's degree, I worked as a pentester and security consultant for about two years.


## Contact {#contact}

-   [Mastodon](https://chaos.social/@d0ntrash)
-   [Twitter](https://twitter.com/d0ntrash)
-   [GitHub](https://github.com/d0ntrash)
-   [LinkedIn](https://www.linkedin.com/in/konstantin-b%C3%BCcheler-118045137)
-   [Email](mailto:k.buecheler@pm.me)
